prusa3d/Prusa-Firmware-Buddy/lib/CycloneTCP/drivers/mac/same54_eth_driver.c
/**
 * @file same54_eth_driver.c
 * @brief SAME54 Ethernet MAC driver
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2021 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneTCP Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.0.4
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL NIC_TRACE_LEVEL

//Dependencies
#include <limits.h>
#include "same54.h"
#include "core/net.h"
#include "drivers/mac/same54_eth_driver.h"
#include "debug.h"

//Underlying network interface
static NetInterface *nicDriverInterface;

//IAR EWARM compiler?
#if defined(__ICCARM__)

//TX buffer
#pragma data_alignment = 8
static uint8_t txBuffer[SAME54_ETH_TX_BUFFER_COUNT][SAME54_ETH_TX_BUFFER_SIZE];
//RX buffer
#pragma data_alignment = 8
static uint8_t rxBuffer[SAME54_ETH_RX_BUFFER_COUNT][SAME54_ETH_RX_BUFFER_SIZE];
//TX buffer descriptors
#pragma data_alignment = 4
static Same54TxBufferDesc txBufferDesc[SAME54_ETH_TX_BUFFER_COUNT];
//RX buffer descriptors
#pragma data_alignment = 4
static Same54RxBufferDesc rxBufferDesc[SAME54_ETH_RX_BUFFER_COUNT];

//Keil MDK-ARM or GCC compiler?
#else

//TX buffer
static uint8_t txBuffer[SAME54_ETH_TX_BUFFER_COUNT][SAME54_ETH_TX_BUFFER_SIZE]
   __attribute__((aligned(8)));
//RX buffer
static uint8_t rxBuffer[SAME54_ETH_RX_BUFFER_COUNT][SAME54_ETH_RX_BUFFER_SIZE]
   __attribute__((aligned(8)));
//TX buffer descriptors
static Same54TxBufferDesc txBufferDesc[SAME54_ETH_TX_BUFFER_COUNT]
   __attribute__((aligned(4)));
//RX buffer descriptors
static Same54RxBufferDesc rxBufferDesc[SAME54_ETH_RX_BUFFER_COUNT]
   __attribute__((aligned(4)));

#endif

//TX buffer index
static uint_t txBufferIndex;
//RX buffer index
static uint_t rxBufferIndex;


/**
 * @brief SAME54 Ethernet MAC driver
 **/

const NicDriver same54EthDriver =
{
   NIC_TYPE_ETHERNET,
   ETH_MTU,
   same54EthInit,
   same54EthTick,
   same54EthEnableIrq,
   same54EthDisableIrq,
   same54EthEventHandler,
   same54EthSendPacket,
   same54EthUpdateMacAddrFilter,
   same54EthUpdateMacConfig,
   same54EthWritePhyReg,
   same54EthReadPhyReg,
   TRUE,
   TRUE,
   TRUE,
   FALSE
};


/**
 * @brief SAME54 Ethernet MAC initialization
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t same54EthInit(NetInterface *interface)
{
   error_t error;
   volatile uint32_t status;

   //Debug message
   TRACE_INFO("Initializing SAME54 Ethernet MAC...\r\n");

   //Save underlying network interface
   nicDriverInterface = interface;

   //Enable GMAC bus clocks (CLK_GMAC_APB and CLK_GMAC_AHB)
   MCLK->APBCMASK.bit.GMAC_ = 1;
   MCLK->AHBMASK.bit.GMAC_ = 1;

   //Disable transmit and receive circuits
   GMAC->NCR.reg = 0;

   //GPIO configuration
   same54EthInitGpio(interface);

   //Configure MDC clock speed
   GMAC->NCFGR.reg = GMAC_NCFGR_CLK(5);
   //Enable management port (MDC and MDIO)
   GMAC->NCR.reg |= GMAC_NCR_MPE;

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Ethernet PHY initialization
      error = interface->phyDriver->init(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Ethernet switch initialization
      error = interface->switchDriver->init(interface);
   }
   else
   {
      //The interface is not properly configured
      error = ERROR_FAILURE;
   }

   //Any error to report?
   if(error)
   {
      return error;
   }

   //Set the MAC address of the station
   GMAC->Sa[0].SAB.reg = interface->macAddr.w[0] | (interface->macAddr.w[1] << 16);
   GMAC->Sa[0].SAT.reg = interface->macAddr.w[2];

   //The MAC supports 3 additional addresses for unicast perfect filtering
   GMAC->Sa[1].SAB.reg = 0;
   GMAC->Sa[2].SAB.reg = 0;
   GMAC->Sa[3].SAB.reg = 0;

   //Initialize hash table
   GMAC->HRB.reg = 0;
   GMAC->HRT.reg = 0;

   //Configure the receive filter
   GMAC->NCFGR.reg |= GMAC_NCFGR_MAXFS | GMAC_NCFGR_MTIHEN;

   //Initialize buffer descriptors
   same54EthInitBufferDesc(interface);

   //Clear transmit status register
   GMAC->TSR.reg = GMAC_TSR_HRESP | GMAC_TSR_UND | GMAC_TSR_TXCOMP | GMAC_TSR_TFC |
      GMAC_TSR_TXGO | GMAC_TSR_RLE | GMAC_TSR_COL | GMAC_TSR_UBR;
   //Clear receive status register
   GMAC->RSR.reg = GMAC_RSR_HNO | GMAC_RSR_RXOVR | GMAC_RSR_REC | GMAC_RSR_BNA;

   //First disable all GMAC interrupts
   GMAC->IDR.reg = 0xFFFFFFFF;
   //Only the desired ones are enabled
   GMAC->IER.reg = GMAC_IER_HRESP | GMAC_IER_ROVR | GMAC_IER_TCOMP | GMAC_IER_TFC |
      GMAC_IER_RLEX | GMAC_IER_TUR | GMAC_IER_RXUBR | GMAC_IER_RCOMP;

   //Read GMAC ISR register to clear any pending interrupt
   status = GMAC->ISR.reg;

   //Set priority grouping (3 bits for pre-emption priority, no bits for subpriority)
   NVIC_SetPriorityGrouping(SAME54_ETH_IRQ_PRIORITY_GROUPING);

   //Configure GMAC interrupt priority
   NVIC_SetPriority(GMAC_IRQn, NVIC_EncodePriority(SAME54_ETH_IRQ_PRIORITY_GROUPING,
      SAME54_ETH_IRQ_GROUP_PRIORITY, SAME54_ETH_IRQ_SUB_PRIORITY));

   //Enable the GMAC to transmit and receive data
   GMAC->NCR.reg |= GMAC_NCR_TXEN | GMAC_NCR_RXEN;

   //Accept any packets from the upper layer
   osSetEvent(&interface->nicTxEvent);

   //Successful initialization
   return NO_ERROR;
}


//SAME54-Xplained-Pro or SAME54-Curiosity-Ultra evaluation board?
#if defined(USE_SAME54_XPLAINED_PRO) || defined(USE_SAME54_CURIOSITY_ULTRA)

/**
 * @brief GPIO configuration
 * @param[in] interface Underlying network interface
 **/

void same54EthInitGpio(NetInterface *interface)
{
//SAME54-Xplained-Pro evaluation board?
#if defined(USE_SAME54_XPLAINED_PRO)
   //Enable PORT bus clock (CLK_PORT_APB)
   MCLK->APBBMASK.bit.PORT_ = 1;

   //Configure GRX1 (PA12)
   PORT->Group[0].PINCFG[12].bit.PMUXEN = 1;
   PORT->Group[0].PMUX[6].bit.PMUXE = MUX_PA12L_GMAC_GRX1;

