prusa3d/Prusa-Firmware-Buddy/lib/CycloneTCP/drivers/mac/same54_eth_driver.c
   //Configure GRX0 (PA13)
   PORT->Group[0].PINCFG[13].bit.PMUXEN = 1;
   PORT->Group[0].PMUX[6].bit.PMUXO = MUX_PA13L_GMAC_GRX0;

   //Configure GTXCK (PA14)
   PORT->Group[0].PINCFG[14].bit.PMUXEN = 1;
   PORT->Group[0].PMUX[7].bit.PMUXE = MUX_PA14L_GMAC_GTXCK;

   //Configure GRXER (PA15)
   PORT->Group[0].PINCFG[15].bit.PMUXEN = 1;
   PORT->Group[0].PMUX[7].bit.PMUXO = MUX_PA15L_GMAC_GRXER;

   //Configure GTXEN (PA17)
   PORT->Group[0].PINCFG[17].bit.DRVSTR = 1;
   PORT->Group[0].PINCFG[17].bit.PMUXEN = 1;
   PORT->Group[0].PMUX[8].bit.PMUXO = MUX_PA17L_GMAC_GTXEN;

   //Configure GTX0 (PA18)
   PORT->Group[0].PINCFG[18].bit.DRVSTR = 1;
   PORT->Group[0].PINCFG[18].bit.PMUXEN = 1;
   PORT->Group[0].PMUX[9].bit.PMUXE = MUX_PA18L_GMAC_GTX0;

   //Configure GTX1 (PA19)
   PORT->Group[0].PINCFG[19].bit.DRVSTR = 1;
   PORT->Group[0].PINCFG[19].bit.PMUXEN = 1;
   PORT->Group[0].PMUX[9].bit.PMUXO = MUX_PA19L_GMAC_GTX1;

   //Configure GMDC (PC11)
   PORT->Group[2].PINCFG[11].bit.PMUXEN = 1;
   PORT->Group[2].PMUX[5].bit.PMUXO = MUX_PC11L_GMAC_GMDC;

   //Configure GMDIO (PC12)
   PORT->Group[2].PINCFG[12].bit.PMUXEN = 1;
   PORT->Group[2].PMUX[6].bit.PMUXE = MUX_PC12L_GMAC_GMDIO;

   //Configure GRXDV (PC20)
   PORT->Group[2].PINCFG[20].bit.PMUXEN = 1;
   PORT->Group[2].PMUX[10].bit.PMUXE = MUX_PC20L_GMAC_GRXDV;

   //Select RMII operation mode
   GMAC->UR.bit.MII = 0;

   //Configure PHY_RESET (PC21) as an output
   PORT->Group[2].DIRSET.reg = PORT_PC21;

   //Reset PHY transceiver
   PORT->Group[2].OUTCLR.reg = PORT_PC21;
   sleep(10);
   PORT->Group[2].OUTSET.reg = PORT_PC21;
   sleep(10);

//SAME54-Curiosity-Ultra evaluation board?
#elif defined(USE_SAME54_CURIOSITY_ULTRA)
   //Enable PORT bus clock (CLK_PORT_APB)
   MCLK->APBBMASK.bit.PORT_ = 1;

   //Configure GRX1 (PA12)
   PORT->Group[0].PINCFG[12].bit.PMUXEN = 1;
   PORT->Group[0].PMUX[6].bit.PMUXE = MUX_PA12L_GMAC_GRX1;

   //Configure GRX0 (PA13)
   PORT->Group[0].PINCFG[13].bit.PMUXEN = 1;
   PORT->Group[0].PMUX[6].bit.PMUXO = MUX_PA13L_GMAC_GRX0;

   //Configure GTXCK (PA14)
   PORT->Group[0].PINCFG[14].bit.PMUXEN = 1;
   PORT->Group[0].PMUX[7].bit.PMUXE = MUX_PA14L_GMAC_GTXCK;

   //Configure GRXER (PA15)
   PORT->Group[0].PINCFG[15].bit.PMUXEN = 1;
   PORT->Group[0].PMUX[7].bit.PMUXO = MUX_PA15L_GMAC_GRXER;

   //Configure GTXEN (PA17)
   PORT->Group[0].PINCFG[17].bit.DRVSTR = 1;
   PORT->Group[0].PINCFG[17].bit.PMUXEN = 1;
   PORT->Group[0].PMUX[8].bit.PMUXO = MUX_PA17L_GMAC_GTXEN;

   //Configure GTX0 (PA18)
   PORT->Group[0].PINCFG[18].bit.DRVSTR = 1;
   PORT->Group[0].PINCFG[18].bit.PMUXEN = 1;
   PORT->Group[0].PMUX[9].bit.PMUXE = MUX_PA18L_GMAC_GTX0;

   //Configure GTX1 (PA19)
   PORT->Group[0].PINCFG[19].bit.DRVSTR = 1;
   PORT->Group[0].PINCFG[19].bit.PMUXEN = 1;
   PORT->Group[0].PMUX[9].bit.PMUXO = MUX_PA19L_GMAC_GTX1;

   //Configure GRXDV (PC20)
   PORT->Group[2].PINCFG[20].bit.PMUXEN = 1;
   PORT->Group[2].PMUX[10].bit.PMUXE = MUX_PC20L_GMAC_GRXDV;

   //Configure GMDC (PC22)
   PORT->Group[2].PINCFG[22].bit.PMUXEN = 1;
   PORT->Group[2].PMUX[11].bit.PMUXE = MUX_PC22L_GMAC_GMDC;

   //Configure GMDIO (PC23)
   PORT->Group[2].PINCFG[23].bit.PMUXEN = 1;
   PORT->Group[2].PMUX[11].bit.PMUXO = MUX_PC23L_GMAC_GMDIO;

   //Select RMII operation mode
   GMAC->UR.bit.MII = 0;

   //Configure PHY_RESET (PC18) as an output
   PORT->Group[2].DIRSET.reg = PORT_PC18;

   //Reset PHY transceiver
   PORT->Group[2].OUTCLR.reg = PORT_PC18;
   sleep(10);
   PORT->Group[2].OUTSET.reg = PORT_PC18;
   sleep(10);
#endif
}

#endif


/**
 * @brief Initialize buffer descriptors
 * @param[in] interface Underlying network interface
 **/

void same54EthInitBufferDesc(NetInterface *interface)
{
   uint_t i;
   uint32_t address;

   //Initialize TX buffer descriptors
   for(i = 0; i < SAME54_ETH_TX_BUFFER_COUNT; i++)
   {
      //Calculate the address of the current TX buffer
      address = (uint32_t) txBuffer[i];
      //Write the address to the descriptor entry
      txBufferDesc[i].address = address;
      //Initialize status field
      txBufferDesc[i].status = GMAC_TX_USED;
   }

   //Mark the last descriptor entry with the wrap flag
   txBufferDesc[i - 1].status |= GMAC_TX_WRAP;
   //Initialize TX buffer index
   txBufferIndex = 0;

   //Initialize RX buffer descriptors
   for(i = 0; i < SAME54_ETH_RX_BUFFER_COUNT; i++)
   {
      //Calculate the address of the current RX buffer
      address = (uint32_t) rxBuffer[i];
      //Write the address to the descriptor entry
      rxBufferDesc[i].address = address & GMAC_RX_ADDRESS;
      //Clear status field
      rxBufferDesc[i].status = 0;
   }

   //Mark the last descriptor entry with the wrap flag
   rxBufferDesc[i - 1].address |= GMAC_RX_WRAP;
   //Initialize RX buffer index
   rxBufferIndex = 0;

   //Start location of the TX descriptor list
   GMAC->TBQB.reg = (uint32_t) txBufferDesc;
   //Start location of the RX descriptor list
   GMAC->RBQB.reg = (uint32_t) rxBufferDesc;
}


/**
 * @brief SAME54 Ethernet MAC timer handler
 *
 * This routine is periodically called by the TCP/IP stack to handle periodic
 * operations such as polling the link state
 *
 * @param[in] interface Underlying network interface
 **/

void same54EthTick(NetInterface *interface)
{
   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Handle periodic operations
      interface->phyDriver->tick(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Handle periodic operations
      interface->switchDriver->tick(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Enable interrupts
 * @param[in] interface Underlying network interface
 **/

void same54EthEnableIrq(NetInterface *interface)
{
   //Enable Ethernet MAC interrupts
   NVIC_EnableIRQ(GMAC_IRQn);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Enable Ethernet PHY interrupts
      interface->phyDriver->enableIrq(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Enable Ethernet switch interrupts
      interface->switchDriver->enableIrq(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Disable interrupts
 * @param[in] interface Underlying network interface
 **/

void same54EthDisableIrq(NetInterface *interface)
{
   //Disable Ethernet MAC interrupts
   NVIC_DisableIRQ(GMAC_IRQn);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Disable Ethernet PHY interrupts
      interface->phyDriver->disableIrq(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Disable Ethernet switch interrupts
      interface->switchDriver->disableIrq(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief SAME54 Ethernet MAC interrupt service routine
 **/

